Documents/АК_ИзменениеУсловийОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>АК_ИзменениеУсловийОбслуживания</Name>
			<BasedOn>
				<xr:Item>Document.АК_ИзменениеУсловийОбслуживания</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АК_УсловияРегламентныхРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АК_ВидыОперацийИзменениеУсловийОбслуживаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеТребуетРегистрацииВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдинаяСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АК_ИзменениеУсловийОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодовОплатыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоОплатыКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧислоОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧислоОплатыКонец</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/АК_УсловияРегламентныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АК_УсловияРегламентныхРабот</Name>
			<Comment>Условия регл. работ в магазинах</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодовОплатыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеТребуетРегистрацииВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоОплатыКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/АК_ВидыОперацийИзменениеУсловийОбслуживаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>АК_ВидыОперацийИзменениеУсловийОбслуживаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Создание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыТорговыхТочек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкороОткрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкороЗакрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПодписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторгнут</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АК_ИзменениеУсловийОбслуживания/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//Контроль
	ГруппировочноеПоле = ?(ВидОперации=Перечисления.АК_ВидыОперацийИзменениеУсловийОбслуживаний.Завершение,"ДатаОкончания","ДатаНачала");
	ТаблицаДатДляСвертки = СтруктурныеЕдиницы.Выгрузить();
	ТаблицаДатДляСвертки.Свернуть(ГруппировочноеПоле);
	Для Каждого СтрокаДаты из ТаблицаДатДляСвертки Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить(ГруппировочноеПоле,СтрокаДаты[ГруппировочноеПоле]);
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаСтруктурныхЕдиниц",СтруктурныеЕдиницы.Выгрузить(ПараметрыОтбора));
		Запрос.УстановитьПараметр("Услуга",Услуга);
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		//СозданиеИзменение
		Если не ВидОперации=Перечисления.АК_ВидыОперацийИзменениеУсловийОбслуживаний.Завершение Тогда
			Запрос.УстановитьПараметр("Период",СтрокаДаты.ДатаНачала);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТаблицаСтруктурныхЕдиниц.СтруктурнаяЕдиница
			               |ПОМЕСТИТЬ ВТ_СтруктурныеЕдиницы
			               |ИЗ
			               |	&ТаблицаСтруктурныхЕдиниц КАК ТаблицаСтруктурныхЕдиниц
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ТаблицаСтруктурныхЕдиниц.СтруктурнаяЕдиница,
			               |	АК_УсловияРегламентныхРаботСрезПоследних.Регистратор,
			               |	ЛОЖЬ КАК ТочкаЗакрыта
			               |ИЗ
			               |	ВТ_СтруктурныеЕдиницы КАК ТаблицаСтруктурныхЕдиниц
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АК_УсловияРегламентныхРабот.СрезПоследних(
			               |				&Период,
			               |				Услуга = &Услуга
			               |					И НЕ Контрагент = &Контрагент) КАК АК_УсловияРегламентныхРаботСрезПоследних
			               |		ПО ТаблицаСтруктурныхЕдиниц.СтруктурнаяЕдиница = АК_УсловияРегламентныхРаботСрезПоследних.СтруктурнаяЕдиница
			               |ГДЕ
						   //+++АК ILIK 2018.08.08 ИП-00019413
			               //|	НЕ АК_УсловияРегламентныхРаботСрезПоследних.СтруктурнаяЕдиница.СтатусТорговойТочки = ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Закрыт)
						   |	НЕ АК_УсловияРегламентныхРаботСрезПоследних.СтруктурнаяЕдиница.СтатусТорговойТочки В (ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Закрыт), ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Приостановлен))
						   //---АК ILIK
			               |	И НЕ АК_УсловияРегламентныхРаботСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Приостановлен)
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ВТ_СтруктурныеЕдиницы.СтруктурнаяЕдиница,
			               |	NULL,
			               |	ИСТИНА
			               |ИЗ
			               |	ВТ_СтруктурныеЕдиницы КАК ВТ_СтруктурныеЕдиницы
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			               |		ПО ВТ_СтруктурныеЕдиницы.СтруктурнаяЕдиница = СтруктурныеЕдиницы.Ссылка
			               |ГДЕ
						   //+++АК ILIK 2018.08.08 ИП-00019413
			               //|	СтруктурныеЕдиницы.СтатусТорговойТочки = ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Закрыт)";
						   |	СтруктурныеЕдиницы.СтатусТорговойТочки В (ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Закрыт), ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Приостановлен))";
						   //---АК ILIK
			Выборка=Запрос.Выполнить().Выбрать();
			//Отказ = Выборка.Количество();
			пока Выборка.Следующий() Цикл
				Если Выборка.ТочкаЗакрыта Тогда
					ОбщегоНазначения.СообщитьОбОшибке("ПРЕДУПРЕЖДЕНИЕ! Торговая точка "+Выборка.СтруктурнаяЕдиница+" закрыта.");
				иначе
					ОбщегоНазначения.СообщитьОбОшибке("ОШИБКА! Для торговой точки "+Выборка.СтруктурнаяЕдиница+" уже есть договор на обслуживание на данный период");
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;
		иначе
			//Закрытие
			Запрос.УстановитьПараметр("Период",СтрокаДаты.ДатаОкончания);
			Запрос.УстановитьПараметр("Регистратор",Ссылка);
			Запрос.Текст = "ВЫБРАТЬ
			|	ТаблицаСтруктурныхЕдиниц.СтруктурнаяЕдиница
			|ПОМЕСТИТЬ ВТ_СтруктурныеЕдиницы
			|ИЗ
			|	&ТаблицаСтруктурныхЕдиниц КАК ТаблицаСтруктурныхЕдиниц
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаСтруктурныхЕдиниц.СтруктурнаяЕдиница,
			|	АК_УсловияРегламентныхРаботСрезПоследних.Регистратор
			|ИЗ
			|	ВТ_СтруктурныеЕдиницы КАК ТаблицаСтруктурныхЕдиниц
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АК_УсловияРегламентныхРабот.СрезПоследних(
			|				&Период,
			|				Контрагент = &Контрагент
			|					И Услуга = &Услуга
			|					И НЕ Регистратор = &Регистратор) КАК АК_УсловияРегламентныхРаботСрезПоследних
			|		ПО ТаблицаСтруктурныхЕдиниц.СтруктурнаяЕдиница = АК_УсловияРегламентныхРаботСрезПоследних.СтруктурнаяЕдиница
			|ГДЕ
			|	(НЕ АК_УсловияРегламентныхРаботСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
			|			ИЛИ АК_УсловияРегламентныхРаботСрезПоследних.Статус ЕСТЬ NULL )";
			Выборка = Запрос.Выполнить().Выбрать();
			Если не Выборка.Количество() = 0 Тогда
				Отказ = Истина;
				Пока Выборка.Следующий()Цикл
					ОбщегоНазначения.СообщитьОбОшибке("ОШИБКА! Для торговой точки "+Выборка.СтруктурнаяЕдиница+" нет действующего договора с этим контрагентом на эту услугу на "+СтрокаДаты.ДатаОкончания);
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	//Движения
	Движения.АК_УсловияРегламентныхРабот.Записывать = Истина;
	Движения.АК_УсловияРегламентныхРабот.Очистить();
	Для Каждого ТекСтрокаСтруктурныеЕдиницы Из СтруктурныеЕдиницы Цикл
		Движение = Движения.АК_УсловияРегламентныхРабот.Добавить();
		Движение.Период = ?(ВидОперации=Перечисления.АК_ВидыОперацийИзменениеУсловийОбслуживаний.Завершение,НачалоДня(ТекСтрокаСтруктурныеЕдиницы.ДатаОкончания),НачалоДня(ТекСтрокаСтруктурныеЕдиницы.ДатаНачала));
		Движение.Контрагент = Контрагент;
		Движение.Услуга = Услуга;
		Движение.СтруктурнаяЕдиница = ТекСтрокаСтруктурныеЕдиницы.СтруктурнаяЕдиница;
		Движение.Статус = ?(ВидОперации=Перечисления.АК_ВидыОперацийИзменениеУсловийОбслуживаний.Завершение,Перечисления.СтатусыДоговоровКонтрагентов.Приостановлен,Перечисления.СтатусыДоговоровКонтрагентов.Действует);
		Движение.Стоимость = ТекСтрокаСтруктурныеЕдиницы.Стоимость;
		Движение.Периодичность = Периодичность;
		Движение.ФормаОплаты = ФормаОплаты;
		Движение.ДатаНачала = ТекСтрокаСтруктурныеЕдиницы.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрокаСтруктурныеЕдиницы.ДатаОкончания;
		Движение.ЧислоОплаты = ТекСтрокаСтруктурныеЕдиницы.ЧислоОплаты;
		Движение.ЧислоОплатыКонец = ТекСтрокаСтруктурныеЕдиницы.ЧислоОплатыКонец;
		Движение.ПериодОплаты = ПериодичностьОплаты;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.НеТребуетРегистрацииВыполнения = НеТребуетРегистрацииВыполнения;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидОперации = Перечисления.АК_ВидыОперацийИзменениеУсловийОбслуживаний.Завершение Тогда
		Если не ЗначениеЗаполнено(ДатаОкончания) Тогда
			ПроверяемыеРеквизиты.Добавить("СтруктурныеЕдиницы.ДатаОкончания");
		КонецЕсли;
	иначе
		Если не ЗначениеЗаполнено(ДатаНачала) Тогда
			ПроверяемыеРеквизиты.Добавить("СтруктурныеЕдиницы.ДатаНачала");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЗаполнениеПустыхРеквизитовСтрокиПоШапке();	
КонецПроцедуры

Процедура ЗаполнениеПустыхРеквизитовСтрокиПоШапке() Экспорт	
	Для Каждого стр из СтруктурныеЕдиницы Цикл	
		ЗаполнитьРеквизитСтроки(стр,"ДатаНачала");
		ЗаполнитьРеквизитСтроки(стр,"ДатаОкончания");
		ЗаполнитьРеквизитСтроки(стр,"ДатаОкончания");
		ЗаполнитьРеквизитСтроки(стр,"ЧислоОплаты");
		ЗаполнитьРеквизитСтроки(стр,"ЧислоОплатыКонец");
		Если ЕдинаяСтоимость Тогда
			стр.Стоимость = Стоимость;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьРеквизитСтроки(СтрокаТЧ,Реквизит)
	Если ЗначениеЗаполнено(ЭтотОбъект[Реквизит]) и не ЗначениеЗаполнено(СтрокаТЧ[Реквизит]) Тогда
		СтрокаТЧ[Реквизит] = ЭтотОбъект[Реквизит];
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АК_ИзменениеУсловийОбслуживания") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		ЭтотОбъект.ВидОперации = Неопределено;
		ЭтотОбъект.ДатаНачала = Неопределено;
		ЭтотОбъект.ДатаОкончания = Неопределено;
		ЭтотОбъект.Номер = Неопределено;
		ЭтотОбъект.Комментарий = Неопределено;
		СтруктурныеЕдиницы.Загрузить(ДанныеЗаполнения.СтруктурныеЕдиницы.Выгрузить(,"СтруктурнаяЕдиница,Стоимость,ЧислоОплаты,ЧислоОплатыКонец"));
	КонецЕсли;
КонецПроцедуры
